DrDeLaBill/stm32_logger/Modules/internal_storage/internal_storage.c
/*
 * internal_storage.c
 *
 *  Created on: 2 ���. 2022 �.
 *      Author: gauss
 */

#include <stdio.h>
#include <string.h>
#include <time.h>
#include <stm32f4xx.h>
#include <fatfs.h>
//
#include "glog.h"
#include "gutils.h"
#include "user_diskio_spi.h"
#include "internal_storage.h"


const char* STOR_MODULE_TAG = "STOR";


FRESULT intstor_read_file(const char* filename, void* buf, UINT size, UINT* br) {
	FRESULT res;
	FRESULT out = FR_OK;

	if(br) (*br) = 0;

	res = f_mount(&DIOSPIFatFS, DIOSPIPath, 1);
	if(res != FR_OK) {
		printTagLog(STOR_MODULE_TAG, "f_mount() error=%i\n", res);
		return res;
	}

	res = f_open(&DIOSPIFile, filename, FA_OPEN_EXISTING|FA_READ);
	if(res != FR_OK) {
		printTagLog(STOR_MODULE_TAG, "f_open() error=%i\r\n", res);
		out = res;
		goto do_umount;
	}

	res = f_read(&DIOSPIFile, (uint8_t*)buf, size, br);
	if(res != FR_OK) {
		printTagLog(STOR_MODULE_TAG, "f_write() error=%i\n", res);
		out = res;
		goto do_close;
	}

do_close:
	res = f_close(&DIOSPIFile);
	if(res != FR_OK) {
		printTagLog(STOR_MODULE_TAG, "f_close() error=%i\n", res);
	}

do_umount:
	res = f_mount(NULL, DIOSPIPath, 0);
	if(res != FR_OK) {
		printTagLog(STOR_MODULE_TAG, "f_mount(umount) error=%i\n", res);
	}

	return out;
}


FRESULT intstor_write_file(const char* filename, const void* buf, UINT size, UINT* bw) {
	FRESULT res;
	FRESULT out = FR_OK;

	if(bw) (*bw) = 0;

	res = f_mount(&DIOSPIFatFS, DIOSPIPath, 1);
	if(res != FR_OK) {
		printTagLog(STOR_MODULE_TAG, "f_mount() error=%i\n", res);
		return res;
	}

	res = f_open(&DIOSPIFile, filename, FA_CREATE_ALWAYS|FA_WRITE);
	if(res != FR_OK) {
		printTagLog(STOR_MODULE_TAG, "f_open() error=%i\n", res);
		out = res;
		goto do_umount;
	}

	res = f_write(&DIOSPIFile, (uint8_t*)buf, size, bw);
	if(res != FR_OK) {
		printTagLog(STOR_MODULE_TAG, "f_write() error=%i\n", res);
		out = res;
		goto do_close;
	}

do_close:
	res = f_close(&DIOSPIFile);
	if(res != FR_OK) {
		printTagLog(STOR_MODULE_TAG, "f_close() error=%i\n", res);
	}

do_umount:
	res = f_mount(NULL, DIOSPIPath, 0);
	if(res != FR_OK) {
		printTagLog(STOR_MODULE_TAG, "f_mount(umount) error=%i\n", res);
	}

	return out;
}


FRESULT intstor_append_file(const char* filename, const void* buf, UINT size, UINT* bw) {
	FRESULT res;
	FRESULT out = FR_OK;

	if(bw) (*bw) = 0;

	res = f_mount(&DIOSPIFatFS, DIOSPIPath, 1);
	if(res != FR_OK) {
		printTagLog(STOR_MODULE_TAG, "f_mount() error=%i\n", res);
		return res;
	}

	res = f_open(&DIOSPIFile, filename, FA_OPEN_APPEND|FA_WRITE);
	if(res != FR_OK) {
		printTagLog(STOR_MODULE_TAG, "f_open() error=%i\n", res);
		out = res;
		goto do_umount;
	}

	res = f_write(&DIOSPIFile, (uint8_t*)buf, size, bw);
	if(res != FR_OK) {
		printTagLog(STOR_MODULE_TAG, "f_write() error=%i\n", res);
		out = res;
		goto do_close;
	}

do_close:
	res = f_close(&DIOSPIFile);
	if(res != FR_OK) {
		printTagLog(STOR_MODULE_TAG, "f_close() error=%i\n", res);
	}

do_umount:
	res = f_mount(NULL, DIOSPIPath, 0);
	if(res != FR_OK) {
		printTagLog(STOR_MODULE_TAG, "f_mount(umount) error=%i\n", res);
	}

	return out;
}
